Repository: dvkch/Backlit
Catalog: SaneScanner/*.lproj/Localizable.strings
Languages: fr

# ACTION CANCEL
source: Cancel
fr: Annuler

# ACTION CONTINUE
source: Continue
fr: Continuer

# ACTION CONTINUE REMEMBER
source: Remember
fr: Sauvegarder

# ACTION CLOSE
source: Close
fr: Fermer

# ACTION DELETE
source: Delete
fr: Supprimer

# ACTION REMOVE
source: Remove
fr: Supprimer

# ACTION SHARE
source: Share
fr: Partager

# ACTION ADD
source: Add
fr: Ajouter

# ACTION SCAN
source: Scan
fr: Scanner

# ACTION PRESS
source: Press
fr: Presser

# ACTION SET VALUE
source: Update value
fr: Mettre à jour

# ACTION HINT TAP TO CANCEL
source: Tap to cancel
fr: Tapper pour annuler

# ACTION OPEN
source: Open
fr: Ouvrir

# ACTION ANALYTICS YES
source: Allow analytics
fr: Autoriser les statistiques

# ACTION ANALYTICS NO
source: Don't ask again
fr: Ne plus me demander

# ACTION EDIT
source: Edit
fr: Modifier

# ACTION SAVE
source: Save
fr: Sauvegarder

source: Loading...
fr: Chargement...

source: Scanning...
fr: Acquisition...

source: Scanning... (%.f%%)
fr: Acquisition... (%.f%%)

# SCANNING %f %d
source: Scanning... (%.f%%, finished %d documents)
fr: Scanning... (%.f%%, %d documents finis)

# PREVIEWING
source: Generating preview...
fr: Aperçu en cours...

# PREVIEWING %f
source: Generating preview... (%.f%%)
fr: Aperçu en cours... (%.f%%)

source: Cancelling...
fr: Annulation...

source: Warming up
fr: Préchauffe

# ERROR MESSAGE PDF NO IMAGES
source: No images selected
fr: Aucune image sélectionnée

# ERROR MESSAGE CANNOT OPEN IMAGES
source: Cannot open images
fr: Impossible d'ouvrir les images

# ERROR MESSAGE CANNOT OPEN IMAGE %@
source: Cannot open image file %@
fr: Impossible d'ouvrir l'image %@

# ERROR MESSAGE INVALID IMAGE DATA %@
source: Invalid image data for file %@
fr: Données images invalides dans le fichier %@

# DEVICES SECTION HOSTS
source: Hosts
fr: Serveurs

# DEVICES SECTION DEVICES
source: Devices
fr: Périphériques

# DEVICES ROW ADD HOST
source: Add a new host...
fr: Ajouter...

# DEVICE SECTION PREVIEW
source: Preview
fr: Aperçu

# DEVICE BUTTON UPDATE PREVIEW
source: Update preview
fr: Générer l'aperçu

# PREVIEW VC NO DEVICE TITLE
source: Select a device
fr: Selectionnez un appareil

# PREVIEW VC NO DEVICE SUBTITLE
source: After selecting a device you'll have the ability to preview then scan a document
fr: Vous pourrez ensuite générer un aperçu ou scanner un document

# PREFERENCES TITLE
source: Preferences
fr: Préférences

# PREFERENCES SECTION SCAN
source: Scan
fr: Acquisition

# PREFERENCES SECTION PREVIEW
source: Preview
fr: Aperçu

# PREFERENCES SECTION ANALYTICS
source: Analytics
fr: Statistiques

# PREFERENCES SECTION ABOUT APP
source: About this app
fr: À propos

# PREFERENCES TITLE PREVIEW DEFAULT COLOR MODE
source: Preview with default color mode
fr: Mode de couleurs par défaut

# PREFERENCES TITLE SHOW ADVANCED OPTIONS
source: Show advanced options
fr: Afficher les options avancées

# PREFERENCES TITLE APP VERSION
source: App version
fr: Version de l'app

# PREFERENCES TITLE SANE VERSION
source: Sane backends version
fr: Version de Sane backends

# PREFERENCES TITLE CONTACT
source: Got some questions? Drop me an email!
fr: Des questions ? Envoyez moi un email !

# PREFERENCES TITLE ENABLE ANALYTICS
source: App analytics
fr: Utilisation de l'app

# PREFERENCES MESSAGE PREVIEW DEFAULT COLOR MODE
source: Will use the default color mode and image intensity, if those options are found and support using an automatic value. Allows for more consistent render accross previews, whatever the option you set, but can reduce preview speed and reset other options depending on the device. This can result in black images when scanning after a preview on some SANE backends (e.g. Pixma 1.0.24).
fr: Utiliser le mode de couleur et l'intensité par défaut lors d'un aperçu, si ces options sont disponibles et supportent un réglage automatique.. Ceci permet d'avoir des aperçus cohérents quelles que soient les options que vous définissez, mais peut augmenter le temps d'acquisition. Ceci peut créer des images noires en scannant après un aperçu sur certains pilotes SANE (ex: Pixma 1.0.24)

# PREFERENCES MESSAGE SHOW ADVANCED OPTIONS
source: Some devices have advanced options, toggling this setting ON will allow you to access them.
fr: Certains périphériques ont des options avancées, utilisez ce réglage pour y accéder.

# PREFERENCES MESSAGE ENABLE ANALYTICS
source: Each event will be sent along with your iOS version, device model and app version. Event-specific data are the number of hosts you have configured, the make of your scanner and possible errors you encountered.
fr: Chaque événement est envoyé avec vottre version iOS, modèle d'appareil, et version de l'application. Les données spécifiques aux événements envoyés sont le nombre d'hôtes configurés, le modèle de votre scanner et les erreurs que vous pouvez rencontrer.

# ANALYTICS ALERT TITLE
source: Do you want to enable anonymous app analytics?
fr: Voulez-vous autoriser l'envoi de statistiques anonymes ?

# MAIL COPY PASTEBOARD NAME
source: Copy email to pasteboard
fr: Copier l'adresse email

# MAIL COPY PASTEBOARD SUCCESS
source: Copied to your pasteboard
fr: Copié dans le presse papier

# MAIL ALERT TITLE
source: Send an email
fr: Envoyer un email

# MAIL ALERT MESSAGE
source: Choose your preferred service
fr: Choisissez votre service préféré

# CONTACT SUBJECT ABOUT APP %@ %@
source: About %@ %@
fr: À props de %@ %@

# GALLERY EMPTY TITLE
source: No images yet
fr: Pas de documents

# GALLERY EMPTY SUBTITLE
source: Scan a document with one of the devices on the left and it will appear here
fr: Scannez un document en utilisant un des périphériques sur la gauche et il apparaitra ici

# GALLERY OVERVIEW TITLE
source: All scans
fr: Documents

# DIALOG ADD HOST TITLE
source: Add a host
fr: Ajouter un hôte

# DIALOG EDIT HOST TITLE
source: Edit the host
fr: Modifier l'hôte

# DIALOG PERSIST HOST TITLE
source: Memorize this host
fr: Sauvegarde l'hôte

# DIALOG ADD HOST MESSAGE
source: Enter the hostname or IP address for the new host
fr: Entrez le nom ou l'adresse IP de l'hôte

# DIALOG ADD HOST PLACEHOLDER HOST
source: Host
fr: Hôte

# DIALOG ADD HOST PLACEHOLDER NAME
source: Nickname
fr: Nom

# DIALOG AUTH TITLE
source: Authentication needed
fr: Authentification requise

# DIALOG AUTH MESSAGE %@
source: Please enter the username and password for %@
fr: Veuillez entrer votre nom d'utilisateur et mot de passe pour %@

# DIALOG DELETE SCAN MESSAGE
source: Are you sure you want to delete this scan?
fr: Etes vous sûr de vouloir supprimer ce document ?

# DIALOG DELETE SCANS MESSAGE %d
source: Are you sure you want to delete %d scans?
fr: Etes vous sûr de vouloir supprimer %d documents ?

# DIALOG COULDNT OPEN DEVICE TITLE
source: Couldn't open device
fr: Accès au périphérique échoué

# OPTION BOOL ON
source: On
fr: Activé

# OPTION BOOL OFF
source: Off
fr: Désactivé

source: Share as PDF
fr: Partager comme PDF

# MENU PREFERENCES
source: Preferences...
fr: Préférences...

# MENU REFRESH
source: Refresh
fr: Rafraîchir

# MENU PREVIEW
source: Preview
fr: Aperçu

# MENU SCAN
source: Scan
fr: Scanner

# MENU ADD HOST
source: New host...
fr: Ajouter un hôte...

# MENU OPEN GALLERY
source: Open image gallery
fr: Ouvrir la gallerie d'images

# MENU ABORT
source: Abort current operation
fr: Annuler l'opération en cours
