Repository: dvkch/Backlit
Catalog: SaneSwift/Localizable/*.lproj/Localizable.strings
Languages: fr

# ERROR MESSAGE SANE ERROR
source: SANE error
fr: Erreur SANE

# ERROR MESSAGE USER CANCELLED
source: Operation canceled
fr: Opération annulée

# ERROR MESSAGE DEVICE NOT OPENED
source: Device is not opened
fr: Le périphérique n'est pas disponible

# ERROR MESSAGE GET VALUE TYPE BUTTON
source: Cannot get the value of a button option
fr: Ne peut pas lire la valeur d'une option de type boutton

# ERROR MESSAGE GET VALUE TYPE GROUP
source: Cannot get the value of a group option
fr: Ne peut pas lire la valeur d'une option de type groupe

# ERROR MESSAGE SET VALUE TYPE GROUP
source: Cannot set the value of a group option
fr: Ne peut pas définir la valeur d'une option de type groupe

# ERROR MESSAGE NO IMAGE DATA
source: No image data
fr: Pas de données image

# ERROR MESSAGE CANNOT GENERATE IMAGE
source: Couldn't generate image
fr: L'image n'a pas pu être générée

# ERROR MESSAGE UNSUPPORTED CHANNELS
source: Unsupported channel type
fr: Type d'image non supporté

# OPTION CONSTRAINED LIST %@
source: Constrained to list: %@
fr: Contraint à la liste : %@

# OPTION CONSTRAINED RANGE FROM TO %@ %@
source: Constrained to range from %@ to %@
fr: Contraint à un interval entre %@ et %@

# OPTION CONSTRAINED RANGE FROM TO STEP %@ %@ %@
source: Constrained to range from %@ to %@ with step of %@
fr: Contraint à un interval entre %@ et %@ par pas de %@

# OPTION CONSTRAINED NOT CONSTRAINED
source: Not constrained
fr: Sans contrainte

# OPTION BOOL ON
source: On
fr: Activé

# OPTION BOOL OFF
source: Off
fr: Désactivé
